@per-lind @octavian2204 - can confirm that I don't see the changes for `cloudflare_zero_trust_access_application` on version  5.1.0, however, we got other application changes for other resources such as `cloudflare_zero_trust_access_policy`.

```
Terraform will perform the following actions:

  # cloudflare_zero_trust_access_policy.<redacted> will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "<redacted>" {
      ~ app_count                      = 8 -> (known after apply)
      ~ approval_groups                = [] -> (known after apply)
      + approval_required              = false
      ~ created_at                     = "2024-06-19T16:56:14Z" -> (known after apply)
        id                             = "<redacted>"
      + isolation_required             = false
        name                           = "<redacted>"
      + purpose_justification_required = false
      ~ reusable                       = true -> (known after apply)
      ~ updated_at                     = "2025-05-21T20:45:39Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```